In [1]:
# SQLAlchemy
from sqlalchemy import create_engine
from sqlalchemy import inspect

# Pandas
import pandas as pd
from datetime import datetime

import os
import numpy as np

import psycopg2

from config import db_password

In [2]:
# Load CSV into a dataFrame
Precipitation_df = pd.read_csv('Resources/35-pcp.csv', skiprows=3)  
Precipitation_df.head()

,Location ID,Location,Date,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,OR-001,Baker County,189501,4.02,109,1.13,2.89
1,OR-001,Baker County,189502,1.06,19,-1.34,2.40
2,OR-001,Baker County,189503,1.26,25,-0.81,2.07
3,OR-001,Baker County,189504,0.94,30,-0.61,1.55
4,OR-001,Baker County,189505,2.45,95,0.68,1.77

In [3]:
# Include only years 2002 to 2015
Precipitation_df = Precipitation_df.loc[(Precipitation_df['Date'] >= 199201) & (Precipitation_df['Date'] <= 201512)]
Precipitation_df.head()

,Location ID,Location,Date,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
1164,OR-001,Baker County,199201,1.25,8,-1.64,2.89
1165,OR-001,Baker County,199202,1.78,48,-0.62,2.40
1166,OR-001,Baker County,199203,0.87,11,-1.20,2.07
1167,OR-001,Baker County,199204,1.70,72,0.15,1.55
1168,OR-001,Baker County,199205,0.53,9,-1.24,1.77

In [4]:
Precipitation_df.dtypes

Location ID                         object
Location                            object
Date                                 int64
Value                              float64
Rank                                 int64
Anomaly (1901-2000 base period)    float64
1901-2000 Mean                     float64
dtype: object

In [5]:
# Drop unneeded columns
Precipitation_df.drop(["Anomaly (1901-2000 base period)", "1901-2000 Mean", "Rank"], axis=1, inplace=True)

In [6]:
# create county code column based on Location ID
Precipitation_df["county_code"] = Precipitation_df["Location ID"].str.slice(3,)
Precipitation_df.head()

     Location ID      Location    Date  Value county_code
1164      OR-001  Baker County  199201   1.25         001
1165      OR-001  Baker County  199202   1.78         001
1166      OR-001  Baker County  199203   0.87         001
1167      OR-001  Baker County  199204   1.70         001
1168      OR-001  Baker County  199205   0.53         001

In [7]:
# Convert date from int to a date
Precipitation_df["Date"] = pd.to_datetime(Precipitation_df["Date"], format = '%Y%m')
Precipitation_df.head()

     Location ID      Location       Date  Value county_code
1164      OR-001  Baker County 1992-01-01   1.25         001
1165      OR-001  Baker County 1992-02-01   1.78         001
1166      OR-001  Baker County 1992-03-01   0.87         001
1167      OR-001  Baker County 1992-04-01   1.70         001
1168      OR-001  Baker County 1992-05-01   0.53         001

In [8]:
# Create a year and month column
Precipitation_df["year"] = Precipitation_df["Date"].dt.year
Precipitation_df["month"] = Precipitation_df["Date"].dt.month
Precipitation_df.tail()

      Location ID        Location       Date  Value county_code  year  month
54927      OR-071  Yamhill County 2015-08-01   0.94         071  2015      8
54928      OR-071  Yamhill County 2015-09-01   1.50         071  2015      9
54929      OR-071  Yamhill County 2015-10-01   4.60         071  2015     10
54930      OR-071  Yamhill County 2015-11-01   9.13         071  2015     11
54931      OR-071  Yamhill County 2015-12-01  22.99         071  2015     12

In [9]:
# Drop Date, Location ID, and Location columns
Precipitation_df.drop(["Date", "Location ID", "Location"], axis=1, inplace=True)

In [10]:
Precipitation_df.head()

      Value county_code  year  month
1164   1.25         001  1992      1
1165   1.78         001  1992      2
1166   0.87         001  1992      3
1167   1.70         001  1992      4
1168   0.53         001  1992      5

In [11]:
# Rename value column to inches 
Precipitation_df.rename(columns={"Value" : "inches"}, inplace=True)
Precipitation_df.head()

      inches county_code  year  month
1164    1.25         001  1992      1
1165    1.78         001  1992      2
1166    0.87         001  1992      3
1167    1.70         001  1992      4
1168    0.53         001  1992      5

In [12]:
# See what is missing
Precipitation_df.count()

inches         10368
county_code    10368
year           10368
month          10368
dtype: int64

In [13]:
#write dataframe to a csv file in the Resource folder
os.makedirs('Resources', exist_ok=True)
Precipitation_df.to_csv('Resources/oregon_precipitation.csv',index=False)

In [14]:
# create yearly totals dataframe by county
yearly_precipitation = Precipitation_df.groupby(["county_code", "year"],as_index=False)["inches"].sum()
yearly_precipitation.head(20)

   county_code  year  inches
0          001  1992   18.46
1          001  1993   22.27
2          001  1994   17.88
3          001  1995   27.31
4          001  1996   27.34
5          001  1997   19.53
6          001  1998   29.86
7          001  1999   19.57
8          001  2000   19.52
9          001  2001   17.82
10         001  2002   15.28
11         001  2003   20.31
12         001  2004   21.17
13         001  2005   22.42
14         001  2006   21.65
15         001  2007   16.71
16         001  2008   20.41
17         001  2009   20.94
18         001  2010   25.95
19         001  2011   21.54

In [15]:
# Round to two decimal places
yearly_precipitation["total_inches"] = np.round(yearly_precipitation["inches"], decimals =2)
yearly_precipitation.head()

  county_code  year  inches  total_inches
0         001  1992   18.46         18.46
1         001  1993   22.27         22.27
2         001  1994   17.88         17.88
3         001  1995   27.31         27.31
4         001  1996   27.34         27.34

In [16]:
# Drop inches column
yearly_precipitation.drop(["inches"], axis=1, inplace=True)

In [17]:
yearly_precipitation.dtypes

county_code      object
year              int64
total_inches    float64
dtype: object

In [18]:
# Connect to the RDS postgres db and add the dataframes to postgres
db_string = f"postgresql://postgres:{db_password}@fires.crlyg1rjxxj2.us-west-2.rds.amazonaws.com:5432/postgres"
engine = create_engine(db_string)

In [19]:
# Write precipitation data to postgres table 
Precipitation_df.to_sql(name="precipitation", index=False, if_exists="replace", con=engine)

In [20]:
# Write yearly_precipitation data to postgres table 
yearly_precipitation.to_sql(name="yearly_precipitation", index=False, if_exists="replace", con=engine)

In [21]:
# Create pivot table of yearly precipitation
yearly_precipitation_table = yearly_precipitation.pivot(index = "county_code", columns = "year", values="total_inches")
yearly_precipitation_table.head()

year,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
county_code,,,,,,,,,,,,,,,,,,,,,
001,18.46,22.27,17.88,27.31,27.34,19.53,29.86,19.57,19.52,17.82,...,21.65,16.71,20.41,20.94,25.95,21.54,21.72,17.59,22.02,20.04
003,46.59,47.88,54.04,75.84,94.51,62.87,77.02,72.16,46.09,48.28,...,73.36,54.33,50.36,51.42,70.89,55.84,80.17,35.15,68.00,55.36
005,62.80,61.76,76.14,93.38,117.92,80.98,87.78,73.79,56.63,64.94,...,87.95,71.57,73.50,69.92,86.07,74.52,97.83,60.61,85.93,68.57
007,69.70,66.17,97.69,102.36,119.57,106.07,109.15,113.20,66.55,77.90,...,102.41,81.56,78.69,79.98,99.42,84.41,112.38,71.68,94.84,93.70
009,46.76,44.33,57.38,66.59,82.72,69.21,69.54,70.68,43.95,49.46,...,71.73,53.56,46.11,49.17,63.10,56.40,71.47,41.26,59.99,58.23

In [22]:
#write dataframe to a csv file in the Resource folder
os.makedirs('Resources', exist_ok=True)
yearly_precipitation_table.to_csv('Resources/yearly_precipitation.csv',index=True)